#### Terraform working directory 🏠: `demo/demo-account/demo-application/elb`
#### Terraform Format and Style 🖌: `success`
#### Terraform Initialization ⚙️: `success`
#### Terraform Plan 📖: `success`
<details><summary>Show Plan</summary>

```hcl
terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.lb_instances.module.lb["alb-test"].module.lb.aws_lb.this[0] will be created
  + resource "aws_lb" "this" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = true
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "alb-test"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = [
          + "sg-08f3c88ea96172393",
        ]
      + subnets                                                      = (known after apply)
      + tags                                                         = {
          + "Name" = "alb-test"
        }
      + tags_all                                                     = {
          + "Name" = "alb-test"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + subnet_mapping {
          + outpost_id = (known after apply)
          + subnet_id  = "subnet-00081d3cb756ff906"
        }
      + subnet_mapping {
          + outpost_id = (known after apply)
          + subnet_id  = "subnet-0706830bb85c7fb8a"
        }

      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "10m"
        }
    }

  # module.lb_instances.module.lb["alb-test"].module.lb.aws_lb_listener.frontend_http_tcp["8080"] will be created
  + resource "aws_lb_listener" "frontend_http_tcp" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 8080
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.lb_instances.module.lb["alb-test"].module.lb.aws_lb_listener_rule.http_tcp_listener_rule["lst-rule-1"] will be created
  + resource "aws_lb_listener_rule" "http_tcp_listener_rule" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 100
      + tags         = {
          + "Name" = "lst-rule-1"
          + "test" = "test2"
        }
      + tags_all     = {
          + "Name" = "lst-rule-1"
          + "test" = "test2"
        }

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + path_pattern {
              + values = [
                  + "/forward/*",
                ]
            }
        }
    }

  # module.lb_instances.module.lb["alb-test"].module.lb.aws_lb_listener_rule.http_tcp_listener_rule["lst-rule-2"] will be created
  + resource "aws_lb_listener_rule" "http_tcp_listener_rule" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 101
      + tags         = {
          + "Name" = "lst-rule-2"
        }
      + tags_all     = {
          + "Name" = "lst-rule-2"
        }

      + action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "www.test.com.sg"
              + path        = "/"
              + port        = "80"
              + protocol    = "HTTP"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }

      + condition {
          + path_pattern {
              + values = [
                  + "/redirect/*",
                ]
            }
        }
    }

  # module.lb_instances.module.lb["alb-test"].module.lb.aws_lb_target_group.main["prdapp"] will be created
  + resource "aws_lb_target_group" "main" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "prdapp"
      + name_prefix                        = (known after apply)
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name" = "prdapp"
        }
      + tags_all                           = {
          + "Name" = "prdapp"
        }
      + target_type                        = "instance"
      + vpc_id                             = "vpc-0e57c5429432ceedd"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 10
          + matcher             = "200-399"
          + path                = "/php/login.php"
          + port                = "8080"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 3
        }

      + stickiness {
          + cookie_duration = 86400
          + enabled         = true
          + type            = "lb_cookie"
        }
    }

  # module.lb_instances.module.lb["alb-test"].module.lb_tg_attachment["tst-ath-0"].aws_lb_target_group_attachment.this["test-host"] will be created
  + resource "aws_lb_target_group_attachment" "this" {
      + id               = (known after apply)
      + port             = 8080
      + target_group_arn = (known after apply)
      + target_id        = "i-04135475dc7445b8f"
    }

  # module.lb_instances.module.lb["alb-test"].module.lb_tg_attachment["tst-ath-0"].aws_lb_target_group_attachment.this["test-host2"] will be created
  + resource "aws_lb_target_group_attachment" "this" {
      + id               = (known after apply)
      + port             = 8080
      + target_group_arn = (known after apply)
      + target_id        = "i-0acf8e28e5ec490e1"
    }

Plan: 7 to add, 0 to change, 0 to destroy.

```

</details>

**Pusher**: @bitzhouwen
**Action**: pull_request
